Revit 2026 API

# SlabShapeCreaseArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SlabShapeCreaseArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
SlabShapeCreaseArrayIterator()
```
```fsharp
new : unit -> SlabShapeCreaseArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

SlabShapeCreaseArrayIterator Class

Autodesk.Revit.DB Namespace